In [1]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [3]:
# Dictionary를 이용한 DataFrame 생성
dict_data = {'c0':[1,2,3] , 'c1':[4,5,6] , 'c2':[7,8,9] , 'c3':[10,11,12] , 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [5]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [7]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [9]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [11]:
# 행 인덱스, 열 이름 변경하기 - 1
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [17]:
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
df

df.rename(columns={'나이':'연령', '성별':'남녀' , '학교':'소속'} , inplace=True) # 컬럼을 지정해서 바꾸기! 모든 컬럼을 안써줘도 된다 / inplace = True 바로 적용하겠다

df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [18]:
# 행 이름 변경하기
# df 의 행 인덱스 중에서, '준서'를 '학생1'로 , '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1','예은':'학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [20]:
data = pd.DataFrame(
    {
        '수학':[90,80,70],
        '영어':[98,89,95],
        '음악':[85,95,100],
        '체육':[100,90,90]

    },
    index=['서준','우현','인아']
)
data

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

## 행 삭제

In [40]:
df2 = data.copy()

In [31]:
# df2의 index가 우현인 1개 행을 삭제한다
# df2.drop('우현' , inplace=True)
df2.drop('우현' , axis=0 , inplace=True) # axis = 0 이 기본값, axis 를 써주는게 좋다
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [39]:
df3 = data.copy()

In [34]:
# df3의 index가 우현과 인아인 2개 행을 삭제 
df3.drop(['우현','인아'] , axis=0 , inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

## 열 삭제

In [38]:
df4 = data.copy()

In [37]:
# df4 의 수학 1개 열을 삭제
df4.drop('수학' , axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [48]:
df5 = data.copy()

# df5의 영어와 음악 2개 열을 삭제
df5.drop(['영어','음악'] , axis='columns', inplace=True) # 'rows' / 'columns'로도 사용 가능
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---